Revit 2026 API

# MetalMetalPerforations Property

---

The property labeled "Cutouts" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPerforations { get; }
```
```vb
Public Shared ReadOnly Property MetalPerforations As String
	Get
```
```cpp
public:
static property String^ MetalPerforations {
	String^ get ();
}
```
```fsharp
static member MetalPerforations : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPerforationsType".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace